[
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 8,
    "question_number": "1",
    "question_text": "Quale delle seguenti affermazioni descrive un obiettivo del test valido?",
    "question_option": {
      "a": "Dimostrare che non esistono difetti non risolti nel sistema sotto test (System Under Test, SUT)",
      "b": "Dimostrare che non si verificheranno failure dopo il rilascio del sistema in produzione",
      "c": "Ridurre il livello di rischio dell'oggetto di test e creare confidenza sul livello di qualità",
      "d": "Verificare che non ci sono combinazioni di input non testate"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 6,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. Il testing rileva difetti e failure, questo riduce il livello di rischio e, allo stesso tempo, fornisce maggiore fiducia al livello di qualità dell'oggetto di test"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. È impossibile dimostrare che non esistono più difetti nel sistema sotto test. Si veda il principio 1 del testing",
      "b": "Non è corretta. Si veda il principio 7 del testing",
      "d": "Non è corretta. È impossibile testare tutte le combinazioni di input (si veda il principio 2 del testing)"
    },
    "ambiguous": false,
    "learning_objective": "FL-1.1.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 8,
    "question_number": "2",
    "question_text": "Quale delle seguenti opzioni descrive un esempio di attività di test che contribuisce al successo?",
    "question_option": {
      "a": "Avere tester coinvolti durante le diverse attività del ciclo di vita dello sviluppo software (Software Development Lifecycle, SDLC) aiuterà a rilevare difetti nei prodotti di lavoro",
      "b": "I tester cercano di non disturbare gli sviluppatori durante la codifica, in modo che gli sviluppatori scrivano codice migliore",
      "c": "I tester che collaborano con gli utenti finali contribuiscono a migliorare la qualità dei defect report durante il testing di integrazione dei componenti e il testing di sistema",
      "d": "I tester certificati progetteranno test case molto migliori dei tester non certificati"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 6,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. importante che i tester siano coinvolti già dalle prime fasi del ciclo di vita dello sviluppo software (SDLC). Questo aumenterà la comprensione delle decisioni di progettazione e consentirà di rilevare presto i difetti"
    },
    "no_answer_option_text": {
      "b": "Non è corretta. Sia gli sviluppatori sia i tester avranno una maggiore comprensione dei reciproci prodotti di lavoro e di come testare il codice",
      "c": "Non è corretta. Gli utenti finali non aiuteranno i tester ad aumentare la qualità dei defect report, inoltre gli utenti normalmente non partecipano ai livelli di test di basso livello, come il testing di integrazione",
      "d": "Non è corretta. Essere certificati non significa automaticamente che il tester sarà più bravo nella progettazione dei test"
    },
    "ambiguous": false,
    "learning_objective": "FL-1.2.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 8,
    "question_number": "3",
    "question_text": "Siete stato assegnato come tester a un team che produce un nuovo sistema in modo incrementale. Avete notato che per diverse iterazioni non sono state apportate modifiche ai regression test esistenti e non sono stati identificati nuovi difetti di regressione. Il vostro manager è soddisfatto, non voi. Quale principio del testing spiega il vostro scetticismo?",
    "question_option": {
      "a": "I test perdono di efficacia",
      "b": "L'assenza di difetti è un'idea sbagliata",
      "c": "I difetti si raggruppano in cluster",
      "d": "Il testing esaustivo è impossibile"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 7,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. Questo principio significa che se gli stessi test vengono ripetuti più volte, alla fine questi test non rilevano più alcun nuovo difetto. Questo è probabilmente il motivo per cui i test sono tutti passati anche in questo rilascio"
    },
    "no_answer_option_text": {
      "b": "Non è corretta. Questo principio descrive l'errata convinzione che la sola rilevazione e correzione di un gran numero di difetti garantisca il successo di un sistema",
      "c": "Non è corretta. Questo principio afferma che un piccolo numero di componenti generalmente contiene la maggior parte dei difetti",
      "d": "Non è corretta. Questo principio afferma che testare tutte le combinazioni di input e di precondizioni non è fattibile"
    },
    "ambiguous": false,
    "learning_objective": "FL-1.3.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 9,
    "question_number": "4",
    "question_text": "Lavorate in un team che sviluppa un'applicazione mobile per ordinare cibo. Nell'iterazione attuale il team ha deciso di implementare la funzionalità di pagamento. Quale delle seguenti attività fa parte dell'analisi dei test?",
    "question_option": {
      "a": "Stimare che il testing dell'integrazione con il servizio di pagamento richiederà 8 giorni-persona",
      "b": "Decidere che il team dovrebbe verificare attraverso il testing se è possibile condividere correttamente i pagamenti tra molti utenti",
      "c": "Utilizzare l'analisi ai valori limite per ricavare i dati di test per i test case che verificano la corretta elaborazione del pagamento, rispetto all'importo minimo consentito da pagare",
      "d": "Analizzare la discrepanza tra il risultato effettivo e il risultato atteso dopo l'esecuzione di un test case che verifica il processo di pagamento con carta di credito e creare un defect report"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 7,
    "answer_option": "b",
    "answer_option_text": {
      "b": "È corretta. Questo è un esempio di definizione delle condizioni di test, che è parte dell'analisi dei test"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Stimare l'effort del test è parte della pianificazione dei test",
      "c": "Non è corretta. L'uso di tecniche di test per ricavare gli elementi di copertura è parte della progettazione dei test",
      "d": "Non è corretta. Il reporting dei difetti rilevati durante iltesting dinamico fa parte dell'esecuzione dei test"
    },
    "ambiguous": false,
    "learning_objective": "FL-1.4.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 9,
    "question_number": "5",
    "question_text": "Quali dei seguenti fattori (i-v) hanno un'influenza SIGNIFICATIVA sull'approccio del test? i. Il ciclo di vita dello sviluppo software ii. Il numero di difetti rilevati nei progetti precedenti iii. I rischi di prodotto identificati iv. Nuovi requisiti normativi che impongono un testing white-box formale V. La configurazione dell'ambiente di test",
    "question_option": {
      "a": "i, ii hanno un'influenza significativa",
      "b": "i, iii, iv hanno un'influenza significativa",
      "c": "ii, iv, v hanno un'influenza significativa",
      "d": "iii, v hanno un'influenza significativa"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 8,
    "answer_option": "b",
    "answer_option_text": {
      "b": "È corretta. Motivazione: (i) È vero. Il ciclo di vita dello sviluppo software (SDLC) ha un'influenza sull'approccio del test. (iii) È vero. I rischi di prodotto identificati sono uno dei fattori più importanti che influenzano l'approccio del test. (iv) È vero. I requisiti normativi sono fattori importanti che influenzano l'approccio del test."
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "c": "Non è corretta",
      "d": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-1.4.2",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 9,
    "question_number": "6",
    "question_text": "Quali DUE dei seguenti compiti appartengono PRINCIPALMENTE a un ruolo di testing?",
    "question_option": {
      "a": "Configurare gli ambienti di test",
      "b": "Mantenere il product backlog",
      "c": "Progettare soluzioni per nuovi requisiti",
      "d": "Creare il test plan",
      "e": "Analizzare la base di test"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 8,
    "answer_option": "a,e",
    "answer_option_text": {
      "a": "È corretta. Questo viene eseguito dai tester",
      "e": "È corretta. Questo viene eseguito dai tester, perché è un'attività tecnica che è parte dell'analisi dei test"
    },
    "no_answer_option_text": {
      "b": "Non è corretta. Il product backlog è costruito e manutenuto dalproduct owner",
      "c": "Non è corretta. Questo viene eseguito dal team di sviluppo",
      "d": "Non è corretta. Questo è un ruolo manageriale"
    },
    "ambiguous": false,
    "learning_objective": "FL-1.4.5",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 10,
    "question_number": "7",
    "question_text": "Quali delle seguenti competenze (i-v) sono le competenze PIÙ importanti per un tester? i. Avere conoscenza del dominio ii. Creare una vision di prodotto iii. Essere un buon giocatore di squadra iv. Pianificare e organizzare il lavoro del team V. Avere pensiero critico (critical thinking)",
    "question_option": {
      "a": "ii e iv sono importanti",
      "b": "i, iii e v sono importanti",
      "c": "i, ii e v sono importanti",
      "d": "iii e iv sono importanti"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 9,
    "answer_option": "b",
    "answer_option_text": {
      "b": "È corretta. Motivazione: (i) È vero. Avere una conoscenza del dominio è una competenza importante per il tester. (iii) È vero. Essere un buon giocatore di squadra è una competenza importante. (v) È vero. Il pensiero critico è una delle competenze più importanti dei tester."
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "c": "Non è corretta",
      "d": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-1.5.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 10,
    "question_number": "8",
    "question_text": "In che modo l'approccio whole-team è presente nelle interazioni tra tester e rappresentanti di business?",
    "question_option": {
      "a": "I rappresentanti di business decidono sugli approcci di test automation",
      "b": "I tester aiutano i rappresentanti di business a definire la strategia di test",
      "c": "I rappresentanti di business non fanno parte dell'approccio whole-team",
      "d": "I tester aiutano i rappresentanti di business a creare test di accettazione adeguati"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 9,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. I tester lavoreranno a stretto contatto con i rappresentanti di business per garantire che vengano raggiunti i livelli di qualità desiderati. Questo include il supporto e la collaborazione con loro per aiutarli a creare test di accettazione adeguati"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. L'approccio alla test automation viene definito dai tester con l'aiuto degli sviluppatori e dei rappresentanti di business",
      "b": "Non è corretta. La strategia di test viene decisa in collaborazione con gli sviluppatori",
      "c": "Non è corretta. I tester, gli sviluppatori e i rappresentanti di business sono parte dell'approccio whole-team"
    },
    "ambiguous": false,
    "learning_objective": "FL-1.5.2",
    "k_level": "K1",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 10,
    "question_number": "9",
    "question_text": "Consideriamo la seguente regola: \"Per ogni attività del ciclo di vita dello sviluppo software (SDLC, software development lifecycle) esiste una corrispondente attività di test\". In quali modelli SDLC è valida questa regola?",
    "question_option": {
      "a": "Solo nei modelli SDLC sequenziali",
      "b": "Solo nei modelli SDLC iterativi",
      "c": "Solo nei modelli SDLC iterativi e incrementali",
      "d": "Nei modelli SDLC sequenziali, incrementali e iterativi"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 10,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. Questa regola vale per tutti i modelli di ciclo di vita dello sviluppo software (SDLC)"
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "b": "Non è corretta",
      "c": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-2.1.2",
    "k_level": "K1",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 11,
    "question_number": "10",
    "question_text": "Quale delle seguenti affermazioni descrive MEGLIO l'approccio acceptance test-driven development (ATDD)?",
    "question_option": {
      "a": "In ATDD, i criteri di accettazione sono tipicamente creati sulla base del formato given/when/then",
      "b": "In ATDD, i test case sono creati principalmente per il testing di componente e sono code-oriented (orientati al codice)",
      "c": "In ATDD i test case sono creati sulla base dei criteri di accettazione, per guidare lo sviluppo del software correlato",
      "d": "In ATDD, i test sono creati sulla base del comportamento desiderato del software, e questo rende più facile la comprensione da parte dei membri del team"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 10,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. Nell'acceptance test-driven development (ATDD), i test vengono scritti a partire dai criteri di accettazione come parte del processo di progettazione"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. più spesso utilizzato nel behaviordriven- development (BDD)",
      "b": "Non è corretta. È la descrizione del test-driven development (TDD)",
      "d": "Non è corretta. Viene utilizzato nel behavior-driven development (BDD)"
    },
    "ambiguous": false,
    "learning_objective": "FL-2.1.3",
    "k_level": "K1",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 11,
    "question_number": "11",
    "question_text": "Quale dei seguenti NON è un esempio di approccio shift-left?",
    "question_option": {
      "a": "Eseguire la review dei requisiti dell'utente prima della loro accettazione formale da parte deglistakeholder",
      "b": "Scrivere un test di componente prima di scrivere il codice corrispondente",
      "c": "Eseguire un testing di efficienza delle prestazioni per un componente durante il testing di componente",
      "d": "Scrivere un test script prima di definire il processo di configuration management"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 10,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. I test script dovrebbero essere soggetti al configuration management, quindi non ha senso creare i test script prima che questo processo sia impostato"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. La review anticipata è un esempio di approccio shift-left",
      "b": "Non è corretta. Il test-driven development (TDD) è un esempio di approccio shift-left",
      "c": "Non è corretta. Il testing non-funzionale anticipato è un esempio di approccio shift-left"
    },
    "ambiguous": false,
    "learning_objective": "FL-2.1.5",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 11,
    "question_number": "12",
    "question_text": "Quale delle seguenti argomentazioni potrebbe essere usata per convincere il vostro manager a organizzare le retrospettive alla fine di ogni release?",
    "question_option": {
      "a": "Le retrospettive sono attualmente molto popolari e i clienti apprezzerebbero se fossero inserite nei nostri processi",
      "b": "Organizzare retrospettive farà risparmiare denaro all'organizzazione perché i rappresentanti degli utenti finali non forniscono un feedback immediato sul prodotto",
      "c": "Le debolezze del processo identificate durante la retrospettiva possono essere analizzate ed essere utilizzate come lista di cose da fare per il programma di continuous process improvement (miglioramento continuo del processo) dell'organizzazione",
      "d": "Le retrospettive rispettano cinque valori, che includono il coraggio e il rispetto, che sono cruciali per mantenere il continuous improvement nell'organizzazione"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 11,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. Le retrospettive condotte regolarmente, in presenza di attività di follow-up appropriate, sono fondamentali per il miglioramento continuo dello sviluppo e del testing"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Le retrospettive sono più utili per identificare le opportunità di miglioramento e hanno poca importanza per i clienti",
      "b": "Non è corretta. Le retrospettive non hanno lo scopo di raccogliere feedback sul prodotto ma sul processo. Inoltre, le retrospettive sono attività interne per il team e non dovrebbero includere rappresentanti degli utenti final",
      "d": "Non è corretta. Il coraggio e il rispetto sono valori dell'Extreme Programming e non sono strettamente correlati alle retrospettive"
    },
    "ambiguous": false,
    "learning_objective": "FL-2.1.6",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 12,
    "question_number": "13",
    "question_text": "Quali tipi di failure (1-4): 1. Failure nel comportamento del sistema, a causa di una deviazione dalle esigenze di business dell'utente. 2. Failure nella comunicazione tra i componenti 3. Failure nella logica in un modulo 4. Failure in regole di business non correttamente implementate si associano MEGLIO ai livelli di test (A-D)? A. Testing di componente B. Testing di integrazione dei componenti C. Testing di sistema D. Testing di accettazione",
    "question_option": {
      "a": "1D, 2B, 3A, 4C",
      "b": "1D, 2B, 3C, 4A",
      "c": "1B, 2A, 3D, 4C",
      "d": "1C, 2B, 3A, 4D"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 11,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. Si consideri che: La base di test per il testing di accettazione è costituita dalle esigenze di business dell'utente (1D); La comunicazione tra i componenti viene testata durante il testing di integrazione dei componenti (2B); I failure nella logica possono essere rilevati durante il testing di componente (3A); Le regole di business sono la base di test per il testing di sistema (4C)"
    },
    "no_answer_option_text": {
      "b": "Non è corretta",
      "c": "Non è corretta",
      "d": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-2.2.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 12,
    "question_number": "14",
    "question_text": "State testando una user story con tre criteri di accettazione: AC1, AC2 e AC3. AC1 è coperto dal test case TC1, AC2 da TC2 e AC3 da TC3. La schedulazione dell'esecuzione dei test prevedeva tre esecuzioni dei test (test run) su tre versioni consecutive del software, come segue: I tre test vengono ripetuti una volta che siete stato informato che tutti i difetti rilevati durante il test run sono stati corretti e che è disponibile una nuova versione del software. Quali dei test descritti nella tabella vengono eseguiti come regression test?",
    "question_option": {
      "a": "Solo 4, 7, 8, 9",
      "b": "Solo 5, 7",
      "c": "Solo 4, 6, 8, 9",
      "d": "Solo 5, 6"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 12,
    "answer_option": "b",
    "answer_option_text": {
      "b": "E corretta. Poiché TC1 e TC3 sono falliti nell'Esecuzione 1 (cioè i test (1) e (3)), i test (4) e (6) sono test confermativi. Poiché TC2 e TC3 sono falliti nell'Esecuzione 2 (cioè i test (5) e (6)), i test (8) e (9) sono test confermativi. TC2 è stato superato nell'Esecuzione 1 (cioè il test (2)), quindi il test (5) è un regression test. TC1 è stato superato nell'Esecuzione 2 (cioè il test (4)), quindi il test (7) è un regression test"
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "c": "Non è corretta",
      "d": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-2.2.3",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 13,
    "question_number": "15",
    "question_text": "Quale dei seguenti NON è un vantaggio del testing statico?",
    "question_option": {
      "a": "Avere un defect management meno costoso grazie alla facilità di rilevare i difetti in una fase successiva del ciclo di vita dello sviluppo software (SDLC)",
      "b": "Correggere i difetti rilevati durante il testing statico è generalmente molto meno costoso che correggere i difetti rilevati durante il testing dinamico",
      "c": "Rilevare difetti di codifica che non sarebbero stati rilevati eseguendo solo il testing dinamico",
      "d": "Rilevare lacune e inconsistenza nei requisiti"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 12,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. Il defect management non è meno costoso. Trovare e correggere i difetti in una fase successiva del ciclo di vita dello sviluppo software (SDLC) è più costoso"
    },
    "no_answer_option_text": {
      "b": "Non è corretta. Questo è un vantaggio del testing statico",
      "c": "Non è corretta. Questo è un vantaggio del testing statico",
      "d": "Non è corretta. Questo è un vantaggio del testing statico"
    },
    "ambiguous": false,
    "learning_objective": "FL-3.1.2",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 13,
    "question_number": "16",
    "question_text": "Quale dei seguenti è un beneficio di un feedback anticipato e frequente?",
    "question_option": {
      "a": "Migliorare il processo di test per i progetti futuri",
      "b": "Forzare i clienti a prioritizzare i loro requisiti in base ai rischi concordati",
      "c": "Fornisce una misura per la qualità delle modifiche",
      "d": "Aiutare a evitare incomprensioni sui requisiti"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 13,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. Un feedback anticipato e frequente può prevenire incomprensioni sui requisiti"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Il feedback può migliorare il processo di test, ma se si vuole solo migliorare i progetti futuri, non è necessario che il feedback arrivi presto o frequentemente",
      "b": "Non è corretta. Il feedback non viene utilizzato per prioritizzare i requisiti",
      "c": "Non è corretta. Non esiste un unico modo raccomandato per misurare la qualità delle modifiche. Inoltre questo non è uno dei benefici del feedback anticipato menzionato nel paragrafo 3.2.1"
    },
    "ambiguous": false,
    "learning_objective": "FL-3.2.1",
    "k_level": "K1",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 13,
    "question_number": "17",
    "question_text": "Le review utilizzate nella vostra organizzazione hanno i seguenti attributi: Esiste il ruolo di scribe Lo scopo principale è valutare la qualità Il meeting viene condotto dall'autore del prodotto di lavoro Può essere svolta una preparazione individuale Viene prodotto un review report Quale dei seguenti tipi di review è PIÙ probabile che venga utilizzato?",
    "question_option": {
      "a": "Review informale",
      "b": "Walkthrough",
      "c": "Review tecnica",
      "d": "Ispezione"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 14,
    "answer_option": "b",
    "answer_option_text": {
      "b": "E corretta. Si considerino gli attributi: Esiste un ruolo di scribe - ruolo specificato per walkthrough, review tecniche e ispezioni; quindi, non possono essere review informali. Lo scopo principale è valutare la qualità è uno degli obiettivi più importanti nel walkthrough, nelle review tecniche e nelle ispezioni; quindi, non possono essere review informali. Il review meeting viene condotto dall'autore del prodotto di lavoro - nelle ispezioni esiste il moderatore e non deve essere l'autore, nelle review tecniche esiste il moderatore e di solito non è l'autore, nel walkthrough esiste un moderatore e di solito è l'autore, nelle review informali può non esistere un moderatore. Può essere svolta una preparazione individuale - la preparazione individuale non è obbligatoria nelle review informali e nelle walkthrough; quindi, non possono essere review tecniche o ispezioni. Viene prodotto un review report - tutti i tipi di review possono produrre un review report, anche se le review informali non richiedono documentazione."
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "c": "Non è corretta",
      "d": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-3.2.4",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 14,
    "question_number": "18",
    "question_text": "Quale delle seguenti affermazioni NON è un fattore che contribuisce al successo delle review?",
    "question_option": {
      "a": "I partecipanti dovrebbero dedicare un tempo adeguato per la review",
      "b": "Suddividere prodotti di lavoro di grandi dimensioni in piccole parti per rendere meno intenso l'effort richiesto",
      "c": "I partecipanti dovrebbero evitare comportamenti che possano indicare noia, esasperazione o ostilità nei confronti degli altri partecipanti",
      "d": "I failure rilevati dovrebbero essere riconosciuti, apprezzati e gestiti in modo oggettivo"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 15,
    "answer_option": "d",
    "answer_option_text": {
      "d": "E corretta. Durante le review si possono rilevare difetti, non failure"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Un tempo adeguato individuale è un fattore di successo",
      "b": "Non è corretta. La suddivisione dei prodotti di lavoro in piccole parti è un fattore di successo",
      "c": "Non è corretta. Evitare comportamenti che possano indicare noia, ęsasperazione, ecc. è un fattore di successo"
    },
    "ambiguous": false,
    "learning_objective": "FL-3.2.5",
    "k_level": "K1",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 14,
    "question_number": "19",
    "question_text": "Quale delle seguenti è una caratteristica delle tecniche di test basate sull'esperienza?",
    "question_option": {
      "a": "I test case vengono creati sulla base di informazioni di progettazione dettagliate",
      "b": "Gli elementi testati all'interno dei moduli di codice dell'interfaccia sono utilizzati per misurare la copertura",
      "c": "Le tecniche si basano molto sulla conoscenza del software e del dominio di business da parte del tester",
      "d": "I test case vengono utilizzati per identificare le deviazioni dai requisiti"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 15,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. Questa è una caratteristica delle tecniche di test basate sull'esperienza. Questa conoscenza ed esperienza da parte del tester includono l'utilizzo atteso del software, il suo ambiente, i difetti probabili, e la distribuzione di questi difetti viene utilizzata per definire i test"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Questa è una caratteristica delle tecniche di test white-box. Le condizioni di test, i test case e i dati di test sono derivati da una base di test che può includere il codice, l'architettura del software, la progettazione dettagliata o qualsiasi altra fonte di informazioni sulla struttura del software",
      "b": "Non è corretta. Questa è una caratteristica delle tecniche di test white-box. La copertura viene misurata in base agli elementi testati all'interno di una struttura selezionata e alla tecnica applicata alla base di test",
      "d": "Non è corretta. Questa è una caratteristica comune delle tecniche di test black-box. I test case possono essere utilizzati per rilevare le lacune nei requisiti e nell'implementazione dei requisiti, nonché le deviazioni dai requisiti"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.1.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 14,
    "question_number": "20",
    "question_text": "State testando un form semplificato per la ricerca di appartamenti, che prevede solo due criteri di ricerca: Piano dell'appartamento (tre possibili opzioni: piano terra; primo piano; secondo piano o superiore) Tipo di giardino (tre possibili opzioni: nessun giardino; giardino piccolo; giardino grande) Solo gli appartamenti al piano terra hanno un giardino. Il form ha un meccanismo di validazione integrato che non vi consentirà di utilizzare i criteri di ricerca che violano questa regola. Ogni test ha due valori di input: piano dell'appartamento e tipo di giardino. Volete applicare il partizionamento di equivalenza per coprire ogni piano dell'appartamento e ogni tipo di giardino. Qual è il numero minimo di test case per ottenere il 100% di copertura del partizionamento di equivalenza?",
    "question_option": {
      "a": "3",
      "b": "4",
      "c": "5",
      "d": "6"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 16,
    "answer_option": "b",
    "answer_option_text": {
      "b": "È corretta. \"Giardino piccolo\" e \"giardino grande\" possono essere correlati solo con piano terra\", quindi abbiamo bisogno di due test case con \"piano terra\" che coprano queste due partizioni \"tipo di giardino\". Abbiamo bisogno di altri due test case per coprire le altre due partizioni primo piano\" e \"secondo piano o superiore\" con la restante partizione \"nessun giardino\". Abbiamo bisogno di un totale di quattro test case: TC1 (piano terra, giardino piccolo) TC2 (piano terra, giardino grande) TC3 (primo piano, nessun giardino) TC4 (secondo piano o superiore, nessun giardino)"
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "c": "Non è corretta",
      "d": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.2.1",
    "k_level": "K3",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 15,
    "question_number": "21",
    "question_text": "State testando un sistema che calcola il voto finale del corso per un determinato studente. Il voto finale viene assegnato in base al risultato finale, secondo le seguenti regole: • 0-50 punti: bocciato • 51-60 punti: discreto • 61-70 punti: sufficiente 71-80 punti: buono 8190 punti: ottimo 91100 punti: eccellente Avete preparato la seguente lista di test case: Qual è la copertura dell'analisi ai valori limite a 2 valori per il risultato finale, che è stata ottenuta con i test case riportati nella lista?",
    "question_option": {
      "a": "50%",
      "b": "60%",
      "c": "33.3%",
      "d": "100%"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 17,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. Esistono 12 valori limite per i valori del risultato finale: 0, 50, 51, 60, 61, 70, 71, 80, 81, 90, 91 e 100. I test case coprono 6 di essi (TC1-91, TC2-50, TC3-81, TC4-60, TC5-70 e TC6 - 80). Pertanto, i test case coprono 6/12=50%."
    },
    "no_answer_option_text": {
      "b": "Non è corretta",
      "c": "Non è corretta",
      "d": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.2.2",
    "k_level": "K3",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 16,
    "question_number": "22",
    "question_text": "Il vostro negozio preferito di noleggio giornaliero di biciclette ha appena introdotto un nuovo sistema di Customer Relationship Management (CRM) e vi è stato chiesto, come socio VIP del negozio, di testarlo. Le funzionalità implementate sono le seguenti: Chiunque può noleggiare una bicicletta, e i soci del negozio ricevono uno sconto del 20% Tuttavia, se il termine di restituzione non viene rispettato, lo sconto non è più disponibile Dopo 15 noleggi, i soci ricevono in regalo una maglietta La tabella delle decisioni che descrive le caratteristiche implementate è la seguente: Basandosi SOLO sulla descrizione delle funzionalità del sistema di Customer Relationship Management, quale delle regole definite sopra descrive una situazione impossibile?",
    "question_option": {
      "a": "R4",
      "b": "R2",
      "c": "R6",
      "d": "R8"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 18,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. Non esiste alcuno sconto per i non soci che hanno anche mancato un termine di restituzione, e solo i soci possono ricevere una maglietta regalo. Pertanto, la situazione è impossibile"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. E' una situazione possibile che un socio senza un termine di restituzione non rispettato possa ottenere uno sconto e una maglietta regalo dopo 15noleggi di biciclette",
      "b": "Non è corretta. E' una situazione possibile che un socio senza un termine di restituzione non rispettato possa ottenere uno sconto ma non una maglietta regalo perché non ha noleggiato una bicicletta per 15 volte",
      "c": "Non è corretta. E' una situazione possibile che i non soci, anche se non hanno ancora mancato un termine di restituzione, non possano ottenere uno sconto e una maglietta regalo"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.2.3",
    "k_level": "K3",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 17,
    "question_number": "23",
    "question_text": "State testando un sistema il cui ciclo di vita è modellato dal seguente state transition diagram. II sistema inizia nello stato INIT e termina il suo funzionamento nello stato OFF. Qual è il numero MINIMO di test case per ottenere una copertura delle transizioni valida?",
    "question_option": {
      "a": "4",
      "b": "2",
      "c": "7",
      "d": "3"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 18,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. Le transizioni \"test\" ed \"error\" non possono verificarsi in un unico test case, ed entrambe non possono essere transizioni \"done\". Questo significa che sono necessari almeno tre test case per ottenere la copertura delle transizioni. Ad esempio: TC1: test, done TC2: run, error, done TC3: run, pause, resume, pause, done"
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "b": "Non è corretta",
      "c": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.2.4",
    "k_level": "K3",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 17,
    "question_number": "24",
    "question_text": "Una test suite ha raggiunto il 100% di copertura delle istruzioni. Qual è la conseguenza di questo risultato?",
    "question_option": {
      "a": "Ogni istruzione nel codice che contiene un difetto è stata eseguita almeno una volta",
      "b": "Qualsiasi test suite che contenga più test case di questa test suite raggiungerà comunque il 100% di copertura delle istruzioni",
      "c": "Ogni cammino nel codice è stato eseguito almeno una volta",
      "d": "Ogni combinazione di valori di input è stata testata almeno una volta"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 19,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. Poiché è stato raggiunto il 100% di copertura delle istruzioni, ogni istruzione, incluse quelle con difetti, deve essere stata eseguita e valutata almeno una volta"
    },
    "no_answer_option_text": {
      "b": "Non è corretta. La copertura dipende da quello che viene testato, non dal numero di test case. Ad esempio, per il codice \"if (x==0) y=1\" un test case (x=0) raggiunge il 100% di copertura delle istruzioni, ma due test case (x=1) e (x=2) insieme raggiungono solo il 50% di copertura delle istruzioni",
      "c": "Non è corretta. Se esiste un loop nel codice, può esistere un numero infinito di percorsi possibili, quindi non è possibile eseguire tutti i percorsi possibili nel codice",
      "d": "Non è corretta. Non è possibile eseguire un testing esaustivo (si vedano i sette principi del testing). Ad esempio, per il codice \"input x; print x\" ogni singolo test con x arbitrario raggiunge il 100% di copertura delle istruzioni, ma copre un solo valore di input"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.3.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 17,
    "question_number": "25",
    "question_text": "Quale delle seguenti affermazioni NON è vera per il testing white-box?",
    "question_option": {
      "a": "Durante il testing white-box viene considerata l'implementazione completa del software",
      "b": "Le metriche di copertura white-box possono aiutare a identificare test aggiuntivi per aumentare la copertura del codice",
      "c": "Le tecniche di test white-box possono essere utilizzate nel testing statico",
      "d": "Il testing white-box può aiutare a identificare le lacune nell'implementazione dei requisiti"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 20,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. Questo è il punto debole delle tecniche di test white-box. Non sono in grado di identificare l'implementazione mancante, perché si basano esclusivamente sulla struttura dell'oggetto di test, non sulle specifiche dei requisiti"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Il punto di forza fondamentale delle tecniche di test white-box è che durante il testing viene presa in considerazione l'implementazione completa del software",
      "b": "Non è corretta. Le misure di copertura white-box forniscono una misura oggettiva della copertura e forniscono le informazioni necessarie per consentire la generazione di test aggiuntivi per aumentare tale copertura",
      "c": "Non è corretta. Le tecniche di test white-box possono essere utilizzate per eseguire review (testing statico)"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.3.3",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 18,
    "question_number": "26",
    "question_text": "Quale delle seguenti affermazioni descrive meglio il concetto di error guessing?",
    "question_option": {
      "a": "Error guessing implica l'utilizzo della propria conoscenza ed esperienza sui difetti rilevati in passato e sugli errori tipici degli sviluppatori",
      "b": "Error guessing implica l'utilizzo della propria esperienza personale sullo sviluppo e sugli errori commessi come sviluppatore",
      "c": "Error guessing richiede di immaginare di essere l'utente dell'oggetto di test e di indovinare gli errori che l'utente potrebbe commettere interagendo con esso",
      "d": "Error guessing richiede di duplicare rapidamente l'attività di sviluppo per identificare il tipo di errori che uno sviluppatore potrebbe commettere"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 21,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. Il concetto base di error guessing è che il tester cerca di indovinare quali errori possono essere stati commessi dallo sviluppatore e quali difetti possono essere presenti nell'oggetto del test, basandosi sull'esperienza passata (e talvoltasulle checklist)"
    },
    "no_answer_option_text": {
      "b": "Non è corretta. Anche se un tester che è stato uno sviluppatore può usare la propria esperienza personale per aiutarsi durante l'esecuzione della tecnica error guessing, questa tecnica di test non si basa sulla conoscenza precedente dello sviluppo",
      "c": "Non è corretta. Error guessing non è una tecnica di usabilità per indovinare come gli utenti potrebbero non riuscire a interagire con l'oggetto di test",
      "d": "Non è corretta. Duplicare l'attività di sviluppo ha diverse problematiche che la rendono impraticabile, come il fatto che il tester ha competenze equivalenti a quelle dello sviluppatore e ha il tempo necessario per lo sviluppo. Non è error guessing"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.4.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 18,
    "question_number": "27",
    "question_text": "Nel vostro progetto si è verificato un ritardo nel rilascio di una nuovissima applicazione e l'esecuzione deitest è iniziata in ritardo, ma avete una conoscenza del dominio molto dettagliata e buone competenze analitiche. L'elenco completo dei requisiti non è ancora stato condiviso con il team, ma il management chiede di presentare alcuni risultati dei test. Quale tecnica di test si adatta MEGLIO a questa situazione?",
    "question_option": {
      "a": "Testing checklist-based",
      "b": "Error guessing",
      "c": "Testing esplorativo",
      "d": "Testing dei rami"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 22,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. Il testing esplorativo è più utile esistono poche specifiche conosciute e e/o esistono tempistiche pressanti per il testing"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Questo è un prodotto nuovo. Probabilmente non avete ancora una checklist e le condizioni di test potrebbero non essere note a causa dei requisiti mancanti",
      "b": "Non è corretta. Questo è un prodotto nuovo. Probabilmente non disponete di informazioni sufficienti per eseguire un error guessing corretto",
      "d": "Non è corretta. Il testing dei rami richiede molto tempo e il management sta chiedendo alcuni risultati di test. Inoltre, il testing dei rami non richiede la conoscenza del dominio"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.4.2",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 19,
    "question_number": "28",
    "question_text": "Quale delle seguenti affermazioni descrive MEGLIO il modo in cui i criteri di accettazione possono essere documentati?",
    "question_option": {
      "a": "Eseguire retrospettive per determinare le attuali esigenze degli stakeholder relativamente a una determinata user story",
      "b": "Utilizzare il formato given/when/then per descrivere un esempio di condizione di test relativa a una determinata user story",
      "c": "Utilizzare la comunicazione verbale per ridurre il rischio di incomprensione dei criteri di accettazione da parte di altri",
      "d": "Documentare i rischi relativi a una determinata user story in un test plan per facilitare il testing basato sul rischio di una determinata user story"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 22,
    "answer_option": "b",
    "answer_option_text": {
      "b": "È corretta. Questo è il modo standard di documentare i criteri di accettazione"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Le retrospettive vengono utilizzate per catturare le lessons learned e per migliorare il processo di sviluppo e di test, non per documentare i criteri di accettazione",
      "c": "Non è corretta. La comunicazione verbale non consente di documentare fisicamente i criteri di accettazione come parte di una user story (aspetto \"carta\" nel modello 3C)",
      "d": "Non è corretta. I criteri di accettazione sono relativi a una user story, non a un test plan. Inoltre, i criteri di accettazione sono le condizioni che devono essere soddisfatte per decidere se la user story è completa. I rischi non sono tali condizioni"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.5.2",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 19,
    "question_number": "29",
    "question_text": "Si consideri la seguente user story: Come Editore Voglio eseguire la review dei contenuti prima che vengano pubblicati in modo da assicurarmi che la grammatica sia corretta e i relativi criteri di accettazione: L'utente può accedere al sistema di content management con il ruolo di \"Editore\" L'editore può visualizzare le pagine di contenuto esistenti L'editore può modificare il contenuto della pagina L'editore può aggiungere commenti di markup L'editore può salvare le modifiche L'editore può riassegnare il ruolo di \"proprietario dei contenuti\" per eseguire gli aggiornamenti Quale dei seguenti è il MIGLIOR esempio di test ATDD per questa user story?",
    "question_option": {
      "a": "Testare se l'editore può salvare il documento dopo aver modificato il contenuto della pagina",
      "b": "Testare se il proprietario dei contenuti può accedere e aggiornare il contenuto",
      "c": "Testare se l'editore può schedulare il contenuto modificato per la pubblicazione",
      "d": "Testare se l'editore può riassegnare a un altro editore l'esecuzione degli aggiornamenti"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 23,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. Questo test copre due criteri di accettazione: uno per la modifica del documento e uno per il salvataggio delle modifiche"
    },
    "no_answer_option_text": {
      "b": "Non è corretta. I criteri di accettazione coprono le attività dell'editore, non quelle del proprietario dei contenuti",
      "c": "Non è corretta. La schedulazione dei contenuti modificati per la pubblicazione può essere una bella funzionalità, ma non è coperta dai criteri di accettazione",
      "d": "Non è corretta. I criteri di accettazione specificano la riassegnazione da un editore al proprietario dei contenuti, non ad un altro editore"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.5.3",
    "k_level": "K3",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 20,
    "question_number": "30",
    "question_text": "In che modo i tester aggiungono valore alla pianificazione dell'iterazione e alla pianificazione della release?",
    "question_option": {
      "a": "I tester determinano la priorità delle user story da sviluppare",
      "b": "I tester si focalizzano solo sugli aspetti funzionali del sistema da testare",
      "c": "I tester partecipano all'identificazione dettagliata dei rischi e alla valutazione dei rischi delle user story",
      "d": "I tester garantiscono il rilascio di software di alta qualità attraverso la progettazione anticipata dei test durante la pianificazione della release"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 23,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. Secondo il syllabus, questo è uno dei modi in cui i tester aggiungono valore alla pianificazione dell'iterazione e alla pianificazione della release"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Le priorità delle user story sono determinate dal rappresentante di business insieme al team di sviluppo",
      "b": "Non è corretta. I tester si focalizzano sugli aspetti funzionali e non- funzionali del sistema da testare",
      "d": "Non è corretta. La progettazione anticipata dei test non è parte della pianificazione della release. La progettazione anticipata dei test non garantisce automaticamente il rilascio di un software di qualità"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.1.2",
    "k_level": "K1",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 20,
    "question_number": "31",
    "question_text": "Quali DUE delle seguenti opzioni possono essere considerate come criteri di uscita relativi alle attività del test di sistema?",
    "question_option": {
      "a": "Readiness dell'ambiente di test",
      "b": "Capacità di eseguire il login dell'oggetto di test da parte del tester",
      "c": "Viene raggiunta la densità stimata dei difetti",
      "d": "I requisiti sono tradotti nel formato given/when/then",
      "e": "I regression test sono automatizzati"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 24,
    "answer_option": "c,e",
    "answer_option_text": {
      "c": "E corretta. La densità stimata dei difetti è una misura di completamento di un'attività; quindi, appartiene ai criteri di uscita",
      "e": "È corretta. L'automazione dei regression test è un criterio di completamento di un'attività; quindi, appartiene ai criteri di uscita"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. La readiness dell'ambiente di test è un criterio di disponibilità delle risorse; quindi, appartiene ai criteri di ingresso",
      "b": "Non è corretta. Questo è un criterio di disponibilità delle risorse; quindi, appartiene ai criteri di ingresso",
      "d": "Non è corretta. I requisiti tradotti in un determinato formato si traducono in requisiti testabili; quindi, appartengono ai criteri di ingresso"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.1.3",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 20,
    "question_number": "32",
    "question_text": "Il vostro team utilizza la tecnica di stima three-point estimation (stima dei tre punti), per stimare l'effort del test per una nuova funzionalità ad alto rischio. Sono state effettuate le seguenti stime: Stima più ottimistica: 2 ore-persona Stima più probabile: 11 ore-persona Stima più pessimistica: 14 ore-persona Qual è la stima finale corretta, quando è richiesto che la tecnica applicata debba prendere in considerazione l'errore di misura?",
    "question_option": {
      "a": "9 ore-persona",
      "b": "14 ore-persona",
      "c": "11 ore-persona",
      "d": "10 ore-persona"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 24,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. La tecnica di stima dei tre punti che considera l'errore di misura è la distribuzione Beta (media ponderata) : E = (ottimistica + 4 * probabile + pessimistica) / 6 E = (2 + (4 * 11) + 14) / 6 = 10"
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "b": "Non è corretta",
      "c": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.1.4",
    "k_level": "K3",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 21,
    "question_number": "33",
    "question_text": "State testando un'applicazione mobile che consente agli utenti di trovare un ristorante nellevicinanze in base al tipo di cibo che desiderano mangiare. Si consideri la seguente lista di test case, la priorità (un valore più piccolo significa una priorità più alta) e le dipendenze: Quale dei seguenti test case dovrebbe essere eseguito come terzo?",
    "question_option": {
      "a": "TC 003",
      "b": "TC 005",
      "c": "TC 002",
      "d": "TC 001"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 25,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. Il test TC 001 deve essere eseguito per primo, seguito da TC 002, per soddisfare le dipendenze. Successivamente, TC 003 per soddisfare la priorità e poi TC 004, seguito da TC 005."
    },
    "no_answer_option_text": {
      "b": "Non è corretta",
      "c": "Non è corretta",
      "d": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.1.5",
    "k_level": "K3",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 21,
    "question_number": "34",
    "question_text": "Considerate le seguenti categorie di test (1-4): 1. Testing di usabilità 2. Testing di componente 3. Testing funzionale 4. Testing di affidabilità e i seguenti quadranti del testing (A-D): A. Quadrante del testing Q1: orientato alla tecnologia che supporta il team di sviluppo B. Quadrante del testing Q2: orientato al business che supporta il team di sviluppo C. Quadrante del testing Q3: orientato al business che critica il prodotto D. Quadrante del testing Q4: orientato alla tecnologia che critica il prodotto A quali quadranti del testing appartengono le categorie di test?",
    "question_option": {
      "a": "1C, 2A, 3B, 4D",
      "b": "1D, 2A, 3C, 4B",
      "c": "1C, 2B, 3D, 4A",
      "d": "1D, 2B, 3C, 4A"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 25,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. Si consideri che: Il testing di usabilità è in Q3 (1-C). Il testing di componente è in Q1 (2 - A). Il testing funzionale è in Q2 (3-B). Il testing di affidabilità è in Q4 (4 - D)."
    },
    "no_answer_option_text": {
      "b": "Non è corretta",
      "c": "Non è corretta",
      "d": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.1.7",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 22,
    "question_number": "35",
    "question_text": "Durante l'analisi del rischio è stato identificato e valutato il seguente rischio: Rischio: tempi di risposta troppo lunghi per generare un report Probabilità del rischio: media; impatto del rischio: alto Risposta al rischio: 0 Un team di test indipendente esegue il performance testing durante il testing di sistema Un campione selezionato di utenti finali esegue il testing di accettazione alpha e beta testing prima del rilascio Quale delle seguenti azioni di risposta viene applicata al rischio analizzato?",
    "question_option": {
      "a": "Accettazione del rischio",
      "b": "Contingency plan",
      "c": "Mitigazione del rischio",
      "d": "Trasferimento del rischio"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 25,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. Le azioni proposte riguardano il testing, che sono una forma di mitigazione del rischio"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Non si accetta il rischio; sono state proposte azioni concrete",
      "b": "Non è corretta. Non sono stati proposti contingency plan",
      "d": "Non è corretta. Il rischio non viene trasferito ma mitigato"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.2.4",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 22,
    "question_number": "36",
    "question_text": "Quale prodotto di lavoro può essere utilizzato da un team Agile per visualizzare la quantità di lavoro completata e la quantità di lavoro totale rimanente per una determinata iterazione?",
    "question_option": {
      "a": "Criteri di accettazione",
      "b": "Defect report",
      "c": "Test completion report",
      "d": "Burndown chart"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 26,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. I burndown chart sono una rappresentazione grafica del lavoro rimasto da svolgere rispetto al tempo rimanente. Vengono aggiornati quotidianamente, in modo da visualizzare in modo continuativo l'avanzamento del lavoro"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. I criteri di accettazione sono le condizioni utilizzate per decidere se la user story è ready. Non possono visualizzare l'avanzamento del lavoro",
      "b": "Non è corretta. I defect report informano sui difetti. Non visualizzano l'avanzamento del lavoro",
      "c": "Non è corretta. Il test completion report può essere creato dopo che l'iterazione è terminata, quindi non mostrerà l'avanzamento in modo continuativo all'interno di un'iterazione"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.3.3",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 22,
    "question_number": "37",
    "question_text": "Dovete aggiornare un test script automatizzato per allinearlo a un nuovo requisito. Quale processo indica la creazione di una nuova versione del test script nel repository di test?",
    "question_option": {
      "a": "Gestione della tracciabilità",
      "b": "Testing di manutenzione",
      "c": "Configuration management",
      "d": "Requirements Engineering"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 26,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. Per supportare il testing, il configuration management può comportare il controllo della versione di tutti gli elementi di test"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. La tracciabilità è la relazione tra due o più prodotti di lavoro, non tra versioni differenti dello stesso prodotto di lavoro",
      "b": "Non è corretta. Il testing di manutenzione riguarda il testing delle modifiche; non è strettamente correlato al versioning",
      "d": "Non è corretta. Il requirements engineering è l'elicitazione, la documentazione e la gestione dei requisiti; non è strettamente correlato al versioning dei test script"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.4.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 23,
    "question_number": "38",
    "question_text": "Avete ricevuto il seguente defect report dagli sviluppatori, in cui si afferma che l'anomalia descritta in questo test report non è riproducibile. L'applicazione si blocca 03-maggio-2022 - John Doe - Rifiutato L'applicazione si blocca dopo aver inserito \"Input del test: $ä\" nel campo Nome nella schermata di creazione di un nuovo utente. Ho provato a disconnettermi e ad accederecon l'account test_admin01, stesso problema. Ho provato con altri account test_admin, stesso problema. Non è stato ricevuto alcun messaggio di errore; il log (vedi allegato) contiene una notifica di errore fatale. In base al test case TC-1305, l'applicazione dovrebbe accettare l'input inserito e creare l'utente. Si prega di risolvere il problema con priorità elevata, poiché questa funzionalità è correlata a REQ-0012, che è un nuovo requisito di business critico. Quali informazioni critiche sono MANCANTI in questo test report che sarebbero state utili per gli sviluppatori?",
    "question_option": {
      "a": "Risultato atteso e risultato ottenuto",
      "b": "Riferimenti e stato del difetto",
      "c": "Ambiente di test e oggetto di test",
      "d": "Priorità e severità"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 27,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. Non si sa in quale ambiente di test sia stata rilevata l'anomalia, e non si sa neanche quale sia l'applicazione (e la relativa versione) impattata"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Il risultato atteso è \"L'applicazione dovrebbe accettare l'input inserito e creare l'utente\". Il risultato effettivo è \"L'applicazione si blocca dopo aver inserito \"Test input. $ä\"\"",
      "b": "Non è corretta. Esiste un riferimento al test case e al relativo requisito, e viene riportato che il difetto è stato rifiutato. Inoltre, lo stato del difetto non sarebbe molto utile per gli sviluppatori",
      "d": "Non è corretta. Il defect report afferma che l'anomalia è urgente, che è un problema globale (cioè molti, se non tutti, gli account di amministrazione dei test sono impattati) e che l'impatto è alto per gli stakeholder di business"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.5.1",
    "k_level": "K3",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 23,
    "question_number": "39",
    "question_text": "Quale attività di test supporta uno strumento di preparazione dei dati?",
    "question_option": {
      "a": "Monitoraggio e controllo dei test",
      "b": "Progettazione dei test",
      "c": "Implementazione dei test",
      "d": "Completamento dei test"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 28,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. L'implementazione dei test include la creazione o l'acquisizione del testware necessario per l'esecuzione dei test (p.e. i dati di test)"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Il monitoraggio dei test comporta il controllo continuo di tutte le attività e il confronto dell'avanzamento effettivo rispetto al test plan. Il controllo dei test comporta l'adozione delle azioni necessarie per raggiungere gli obiettivi del test nel test plan. Durante queste attività non vengono preparati i dati di test",
      "b": "Non è corretta. La progettazione dei test include l'elaborazione delle condizioni ditest in test case e altro testware. I dati di test non vengono preparati durante questa attività",
      "d": "Non è corretta. Le attività di completamento dei test vengono svolte in corrispondenza delle milestone del progetto (p.e. rilascio, fine dell'iterazione, completamento del livello di test), quindi è troppo tardi per preparare i dati di test"
    },
    "ambiguous": false,
    "learning_objective": "FL-6.1.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 23,
    "question_number": "40",
    "question_text": "Quale risposta identifica correttamente un rischio potenziale dell'esecuzione della test automation?",
    "question_option": {
      "a": "Può introdurre regressioni sconosciute in produzione",
      "b": "Gli effort necessari a manutenere il testware possono non essere allocati in modo appropriato",
      "c": "Gli strumenti di test e il relativo testware possono non essere sufficientemente affidabili",
      "d": "Può essere ridotto il tempo dedicato al testing manuale"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 28,
    "answer_option": "b",
    "answer_option_text": {
      "b": "È corretta. L'errata allocazione dell'effort per la manutenzione del testware è un rischio"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. La test automation non introduce regressioni sconosciute in produzione",
      "c": "Non è corretta. Gli strumenti di test devono essere selezionati in modo da poter fare affidamento su di essi e sul relativo testware",
      "d": "Non è corretta. L'obiettivo principale della test automation è ridurre il testing manuale. Si tratta quindi di un vantaggio, non di un rischio"
    },
    "ambiguous": false,
    "learning_objective": "FL-6.2.1",
    "k_level": "K1",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 24,
    "question_number": "A1",
    "question_text": "Vi è stato affidato il compito di analizzare e correggere le cause dei failure in un nuovo sistema da rilasciare. Quale attività state svolgendo?",
    "question_option": {
      "a": "Debugging",
      "b": "Testing del software",
      "c": "Elicitazione dei requisiti",
      "d": "Defect management"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 30,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. Il debugging è il processo di rilevazione, analisi ed correzione delle cause dei failure in un componente o in un sistema"
    },
    "no_answer_option_text": {
      "b": "Non è corretta. Il testing è il processo che riguarda la pianificazione, la preparazione e la valutazione di un componente o di un sistema e dei relativi prodotti di lavoro, per determinare se soddisfano i requisiti specificati, per dimostrare che sono adatti allo scopo e per rilevare i difetti. Non è relativo alla risoluzione delle cause dei failure",
      "c": "Non è corretta. L'elicitazione dei requisiti è il processo di raccolta, cattura e consolidamento dei requisiti dalle sorgenti disponibili. Non è relativo alla risoluzione delle cause dei failure",
      "d": "Non è corretta. Il defect management è il processo di riconoscimento, registrazione, classificazione, indagine, risoluzione e chiusura dei difetti. Non è relativo alla risoluzione delle cause dei failure"
    },
    "ambiguous": false,
    "learning_objective": "FL-1.1.2",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 24,
    "question_number": "A2",
    "question_text": "In molte organizzazioni software, il dipartimento di test è chiamato dipartimento di Quality Assurance (QA). Questa affermazione è corretta oppure non è corretta, e perché?",
    "question_option": {
      "a": "È corretta. Testing e QA significano esattamente la stessa cosa",
      "b": "È corretta. Questi termini possono essere usati in modo intercambiabile perché sia il testing sia QA focalizzano le attività sugli stessi problemi di qualità",
      "c": "Non è corretta. Il testing è qualcosa di più e comprende tutte le attività relative alla qualità. QA si focalizza sui processi relativi alla qualità",
      "d": "Non è corretta. QA si focalizza sui processi relativi alla qualità, il testing si focalizza sul dimostrare che un componente o sistema sia adatto allo scopo (fit for purpose) e sul rilevare difetti"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 31,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. SI consideri che: Il testing e la quality assurance non sono la stessa cosa. Il testing è il processo che consiste di tutte le attività del ciclo di vita dello sviluppo software (SDLC), sia statiche sia dinamiche, che riguardano la pianificazione, la preparazione e la valutazione di un componente o sistema e dei relativi prodotti di lavoro, per determinare che soddisfino i requisiti specificati, per dimostrare che sono adatti allo scopo e per rilevare i difetti. Quality assurance si focalizza sulla definizione, introduzione, monitoraggio, miglioramento e aderenza ai processi relativi alla qualità."
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "b": "Non è corretta",
      "c": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL1.2.2-",
    "k_level": "K1",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 24,
    "question_number": "A3",
    "question_text": "Un telefono che squilla in un ufficio vicino distrae un programmatore causando una codifica impropria della logica che verifica il limite superiore di una variabile di input. Successivamente, duranteil testing di sistema, un tester si accorge che questo campo di input accetta valori di input invalidi. Quale dei seguenti descrive correttamente la codifica errata del limite superiore?",
    "question_option": {
      "a": "La root cause",
      "b": "Un failure",
      "c": "Un errore",
      "d": "Un difetto"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 31,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. Il problema nel codice è un difetto"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. La root cause è la distrazione che il programmatore ha avuto durante la programmazione",
      "b": "Non è corretta. Accettare input non validi è un failure",
      "c": "Non è corretta. L'errore è il pensiero sbagliato che ha portato a inserire il difetto nel codice"
    },
    "ambiguous": false,
    "learning_objective": "FL1.2.3-",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 25,
    "question_number": "A4",
    "question_text": "Si consideri il seguente testware: Quale attività di test produce questo testware come output?",
    "question_option": {
      "a": "Pianificazione dei test",
      "b": "Monitoraggio e controllo dei test",
      "c": "Analisi dei test",
      "d": "Progettazione dei test"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 32,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. Il testware preso in considerazione è una test charter. I test charter sono l'output della progettazione dei test."
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "b": "Non è corretta",
      "c": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL1.4.3-",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 25,
    "question_number": "A5",
    "question_text": "Quale dei seguenti è il MIGLIOR esempio di come la tracciabilità supporta il testing?",
    "question_option": {
      "a": "Eseguire l'analisi degli impatti di una modifica fornirà informazioni sul completamento dei test",
      "b": "Analizzare la tracciabilità tra i test case e i risultati dei test fornirà informazioni sul livello di rischio residuo stimato",
      "c": "Eseguire l'analisi degli impatti di una modifica aiuterà a selezionare i giusti test case per il regression testing",
      "d": "Analizzare la tracciabilità tra la base di test, gli oggetti di test e i test case aiuterà a selezionare i dati di test per raggiungere la copertura attesa dell'oggetto di test"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 32,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. L'analisi degli impatti delle modifiche aiuta a selezionare i test case per il regression testing"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Eseguire l'analisi degli impatti non fornirà informazioni sulla completezza dei test. L'analisi degli impatti dellemodifiche aiuterà a selezionare i giusti test case per l'esecuzione",
      "b": "Non è corretta. La tracciabilità non fornisce informazioni sul livello stimato di rischio residuo se i test case non sono tracciati rispetto ai rischi",
      "d": "Non è corretta. L'analisi della tracciabilità tra la base di test, gli oggetti di test e i test case non aiuta a selezionare i dati di test per ottenere la copertura richiesta dell'oggetto di test. La selezione dei dati di test è più legata alla progettazione dei test e all'implementazione dei test, non alla tracciabilità"
    },
    "ambiguous": false,
    "learning_objective": "FL-1.4.4",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 25,
    "question_number": "A6",
    "question_text": "Quale dei seguenti è la MIGLIORE spiegazione di un vantaggio dell'indipendenza del testing?",
    "question_option": {
      "a": "Un team di test indipendente permette al project management di assegnare al team di test la responsabilità della qualità del rilascio finale",
      "b": "Se è possibile utilizzare un team di test esterno all'organizzazione, si ottengono notevoli vantaggi perché questo team esterno non è facilmente influenzato dalle preoccupazioni del project management sul rilascio, e dalla necessità di rispettare scadenze rigorose",
      "c": "Un team di test indipendente può lavorare separatamente dagli sviluppatori, non viene distratto dalle modifiche dei requisiti del progetto e può limitare la comunicazione con gli sviluppatori per il reporting dei difetti attraverso un sistema di defect management",
      "d": "Quando le specifiche contengono ambiguità e inconsistenze, vengono fatte delle assunzioni sulla loro interpretazione, e un tester indipendente può essere utile per mettere in discussione queste assunzioni e le interpretazioni fatte dallo sviluppatore"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 33,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. Le specifiche non sono mai perfette, il che significa che lo sviluppatore dovrà fare delle assunzioni. Un tester indipendente è utile in quanto può mettere in discussione e verificare le assunzioni e le successive interpretazioni fatte dallo sviluppatore"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. La qualità dovrebbe essere responsabilità di tutti coloro che lavorano sul progetto e non solo responsabilità del team di test",
      "b": "Non è corretta. In primo luogo, non è un vantaggio se un team di test esterno non rispetta le scadenze di rilascio. In secondo luogo, non esiste motivo di credere che i team di test esterni ritengano di non dover rispettare scadenze di consegna rigorose",
      "c": "Non è corretta. È una cattiva pratica che il team di test lavori in completo isolamento. Ci si aspetta che un team di test esterno si preoccupi delle modifiche ai requisiti del progetto e di comunicare bene con gli sviluppatori"
    },
    "ambiguous": false,
    "learning_objective": "FL1.5.3-",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 26,
    "question_number": "A7",
    "question_text": "State lavorando come tester in un team che segue il V-model. Quale delle seguenti attività PUO' essere eseguita nelle fasi iniziali del ciclo di vita del siftware (SDLC)?",
    "question_option": {
      "a": "L'esecuzione del testing dinamico",
      "b": "Il testing statico",
      "c": "La pianificazione dei test",
      "d": "L'esecuzione del testing di accettazione",
      "e": "Il testing di manutenzione"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 34,
    "answer_option": "b,c",
    "answer_option_text": {
      "b": "È corretta. Nei modelli di sviluppo sequenziali, nelle fasi iniziali i tester partecipano alla review dei requisiti, che è una forma di testing statico",
      "c": "È corretta. La pianificazione dei test potrebbe essere eseguita nelle prime fasi del SDLC, prima dell'inizio del progetto di test, insieme all'analisi e alla progettazione dei test"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Il codice eseguibile viene generalmente creato nelle fasi successive, quindi l'esecuzione del testing dinamico non può essere eseguito nelle prime fasi del ciclo di vita dello sviluppo software (SDLC)",
      "d": "Non è corretta. L'esecuzione del testing di accettazione può essere eseguito quando esiste un prodotto funzionante. Nei modelli di SDLC sequenziali, il prodotto funzionante viene generalmente rilasciato nelle fasi finali del SDLC",
      "e": "Non è corretta. Il testing di manutenzione quando esiste un prodotto rilasciato e funzionante, non viene svolto nelle prime fasi del SDLC"
    },
    "ambiguous": false,
    "learning_objective": "FL-2.1.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 26,
    "question_number": "A8",
    "question_text": "Quali dei seguenti sono vantaggi del DevOps? i. Rilascio del prodotto più rapido e time to market più veloce ii. Aumento della necessità di testing manuale ripetitivo iii. Disponibilità costante di software eseguibile iv. Riduzione del numero di regression test associati al refactoring del codice v. Impostare il framework di test automation è poco costoso, poiché tutto èautomatizzato",
    "question_option": {
      "a": "i, ii, iv sono vantaggi",
      "b": "iii, v sono vantaggi",
      "c": "i, iii sono vantaggi",
      "d": "ii, iv, v sono vantaggi"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 35,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. Si consideri che: i. Vero. Il rilascio più rapido del prodotto e il time to market più veloce sono un vantaggio di DevOps. iii. Vero. La disponibilità costante di software eseguibile è un vantaggio."
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "b": "Non è corretta",
      "d": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-2.1.4",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 26,
    "question_number": "A9",
    "question_text": "Lavorate come tester in un progetto su un'applicazione mobile per ordinare cibo per uno dei vostri clienti. Il cliente vi ha inviato una lista dei requisiti. Uno di questi requisiti, di alta priorità, viene così definito: \"L'ordine deve essere elaborato in meno di 10 secondi nel 95% dei casi\". Avete creato un insieme di test case in cui sono stati fatti un numero casuale di ordini, è stato misurato il tempo di elaborazione e sono stati verificati i risultati dei test rispetto ai requisiti. Quale tipo di test avete eseguito?",
    "question_option": {
      "a": "Test funzionale, perché i test case coprono i requisiti di business dell'utente per il sistema",
      "b": "Test non-funzionale, perché i test case misurano le prestazioni del sistema",
      "c": "Test funzionale, perché i test case interagiscono con l'interfaccia utente",
      "d": "Test white-box, perché si deve conoscere la struttura interna del codice per misurare il tempo di elaborazione degli ordini"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 36,
    "answer_option": "b",
    "answer_option_text": {
      "b": "È corretta. Questo è un esempio di performance testing, un tipo di testing non-funzionale"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Il fatto che il requisito relativo alle prestazioni del sistema è stato richiesto direttamente dal cliente e che le prestazioni siano importanti dal punto di vista del business (cioè, ad alta priorità) non rende questi test funzionali, perché non verificano \"cosa\" fa il sistema, ma \"come\" (cioè, quanto velocemente vengono elaborati gli ordini)",
      "c": "Non è corretta. Dallo scenario non si conosce se l'interazione con l'interfaccia utente sia parte delle condizioni di test. Ma anche se fosse conosciuto, l'obiettivo principale del test è verificare le prestazioni, non l'usabilità",
      "d": "Non è corretta. Non è necessario conoscere la struttura interna del codice per eseguire il performance testing. Si possono eseguire test di efficienza delle prestazioni senza conoscere la struttura"
    },
    "ambiguous": false,
    "learning_objective": "FL-2.2.2",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 27,
    "question_number": "A10",
    "question_text": "La strategia di test della vostra organizzazione suggerisce che durante il ritiro di un sistema dovrà essere testata la migrazione dei dati. Quale testing è PIÙ probabile che venga eseguito?",
    "question_option": {
      "a": "Testing di manutenzione",
      "b": "Regression testing",
      "c": "Testing di componente",
      "d": "Testing di integrazione"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 36,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. Quando un sistema viene ritirato, può essere richiesto il testing della migrazione dei dati, che è una forma di testing di manutenzione"
    },
    "no_answer_option_text": {
      "b": "Non è corretta. Il regression testing verifica se una correzione ha accidentalmente influenzato il comportamento di altre parti del codice, ma la domanda è relativa alla migrazione dei dati verso un nuovo sistema",
      "c": "Non è corretta. Il testing di componente si focalizza sui singoli componenti hardware o software, non sulla migrazione dei dati",
      "d": "Non è corretta. Il testing di integrazione si focalizza sulle interazioni tra componenti e/o sistemi, non sulla migrazione dei dati"
    },
    "ambiguous": false,
    "learning_objective": "FL-2.3.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 27,
    "question_number": "A11",
    "question_text": "Di seguito sono elencati i prodotti di lavoro realizzati in un ciclo di vita dello sviluppo software: i. Requisiti di business ii. Schedulazione iii. Budget del test iv. Codice eseguibile di terze parti v. User story e relativi criteri di accettazione Quali di questi prodotti di lavoro possono essere sottoposti a review?",
    "question_option": {
      "a": "i e iv possono essere sottoposti a review",
      "b": "i, ii, iii e iv possono essere sottoposti a review",
      "c": "i, ii, iii e v possono essere sottoposti a review",
      "d": "iii, iv e v possono essere sottoposti a review"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 37,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. Solo il codice eseguibile di terze parti non può essere sottoposto a review."
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "b": "Non è corretta",
      "d": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-3.1.1",
    "k_level": "K1",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 27,
    "question_number": "A12",
    "question_text": "Quali delle seguenti affermazioni (i-v) sono vere per il testing statico: i. I comportamenti esterni anomali sono più facili da identificare ii. Le discrepanze rispetto a uno standard di codifica sono più facili da individuare iii. Identifica i failure causati dai difetti durante l'esecuzione del software iv. L'obiettivo è identificare i difetti il prima possibile v. La mancanza di copertura per i requisiti di sicurezza critici è più facile da rilevare e correggere",
    "question_option": {
      "a": "i, iv, v sono veri per il testing statico",
      "b": "i, iii, iv sono veri per il testing statico",
      "c": "ii, iii sono veri per il testing statico",
      "d": "ii, iv, v sono veri per il testing statico"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 37,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. Spiegazione: (ii) Questo è un esempio di deviazione dagli standard, che è un tipico difetto che è più facile rilevare con il testing statico. (iv) Identificare i difetti il prima possibile è l'obiettivo del test sia del testing statico sia del testing dinamico. (v) Questo è un esempio di lacune nella tracciabilità o nella copertura della base di test, che è un difetto tipico che si rileva più facilmente con il testing statico."
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "b": "Non è corretta",
      "c": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-3.1.3",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 28,
    "question_number": "A13",
    "question_text": "Quale delle seguenti affermazioni sulle review formali è VERA?",
    "question_option": {
      "a": "Alcune review non richiedono più di un ruolo",
      "b": "Il processo di review prevede diverse attività",
      "c": "La documentazione da sottoporre a review non viene distribuita prima del review meeting, ad eccezione di specifici tipi di review",
      "d": "I difetti rilevati durante la review non vengono segnalati, poiché non vengono rilevati dal testing dinamico"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 38,
    "answer_option": "b",
    "answer_option_text": {
      "b": "È corretta. Durante il processo di review formale si svolgono diverse attività"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. In tutti i tipi di review esiste più di un ruolo, anche in quelle informali",
      "c": "Non è corretta. La documentazione da sottoporre a review dovrebbe essere distribuita il prima possibile",
      "d": "Non è corretta. I difetti rilevati durante la review dovrebbero essere tracciati"
    },
    "ambiguous": false,
    "learning_objective": "FL-3.2.2",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 28,
    "question_number": "A14",
    "question_text": "Quale compito può svolgere il management durante una review formale?",
    "question_option": {
      "a": "Assumere la responsabilità generale della review",
      "b": "Decidere cosa deve essere sottoposto a review",
      "c": "Garantire l'efficace esecuzione dei review meeting e mediare, se necessario",
      "d": "Registrare le informazioni della review, come le decisioni sulla review"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 38,
    "answer_option": "b",
    "answer_option_text": {
      "b": "È corretta. Questo è il compito del management in una review formale"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Questo è il compito del review leader",
      "c": "Non è corretta. Questo è il compito del moderatore",
      "d": "Non è corretta. Questo è il compito dello scribe"
    },
    "ambiguous": false,
    "learning_objective": "FL-3.2.3",
    "k_level": "K1",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 28,
    "question_number": "A15",
    "question_text": "Un sistema di conservazione del vino utilizza un dispositivo di controllo che misura la temperatura T della cella del vino (misurata in °C, arrotondata al grado più vicino) e segnala all'utente le deviazioni della temperatura dal valore ottimale 12, secondo le seguenti regole: se T=12, il sistema visualizza il messaggio: \"Temperatura ottimale\" se T<12, il sistema visualizza il messaggio: \"Temperatura troppo bassa!\" se T>12 il sistema visualizza il messaggio: \"Temperatura troppo alta!\" Volete utilizzare l'analisi ai valori limite a 3 valori per verificare il comportamento del dispositivo di controllo. L'input di un test è una temperatura in °C fornita dal dispositivo. Qual è l'insieme MINIMO di input di test che raggiunge il 100% di copertura desiderata?",
    "question_option": {
      "a": "11, 12, 13",
      "b": "10, 12, 14",
      "c": "10, 11, 12, 13, 14",
      "d": "10, 11, 13, 14"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 38,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. Esistono tre partizioni di equivalenza: {..., 10, 11}, {12} e {13, 14, ...). I valori limite sono 11, 12 e 13. Nell'analisi ai valori limite a tre valori: per il limite 11: test dei valori 10, 11, 12; per il limite 12: test dei valori 11, 12, 13; per il limite 13: test dei valori 12, 13, 14. Complessivamente dobbiamo testare 10, 11, 12, 13 e 14."
    },
    "no_answer_option_text": {
      "a": "Non è corretta",
      "b": "Non è corretta",
      "d": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.2.2",
    "k_level": "K3",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 29,
    "question_number": "A16",
    "question_text": "Quale delle seguenti affermazioni sul testing dei rami è CORRETTA?",
    "question_option": {
      "a": "Se un programma include solo rami non condizionali, può essere raggiunta la copertura del 100% dei rami senza eseguire alcun test case",
      "b": "Se i test case esercitano tutti i rami non condizionali del codice, viene raggiunta la copertura del 100% dei rami",
      "c": "Se viene raggiunta la copertura del 100% delle istruzioni, allora viene raggiunta anche la copertura del 100% dei rami",
      "d": "Se viene raggiunta la copertura del 100% dei rami, allora vengono esercitati tutti gli esiti decisionali in ogni decisione del codice"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 39,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. Ogni esito decisionale corrisponde a un ramo condizionale, quindi il 100% di copertura dei rami implica il 100% di copertura delle decisioni"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. In questo caso è necessario un test case, poiché esiste almeno un ramo (non condizionale) da coprire",
      "b": "Non è corretta. La copertura dei soli rami non condizionali non implica la copertura di tutti i rami condizionali",
      "c": "Non è corretta. II 100% di copertura dei rami implica il 100% di copertura delle istruzioni, ma non il viceversa. Ad esempio, per una decisione IF senza ELSE, un test case è sufficiente per ottenere il 100% di copertura delle istruzioni, ma raggiunge solo il 50% di copertura dei rami"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.3.2",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 29,
    "question_number": "A17",
    "question_text": "State testando un'applicazione mobile che consente ai clienti di accedere e gestire i loro conti bancari. State eseguendo una test suite che prevede la valutazione di ogni schermata e di ogni campo in ogni schermata, rispetto a una lista generale di best practice della user interface, che sono state derivate da un libro molto conosciuto sull'argomento, che aiutano a massimizzare l'attrattiva, la facilità di utilizzo e l'accessibilità di queste applicazioni. Quale delle seguenti opzioni categorizza MEGLIO la tecnica di test che state utilizzando?",
    "question_option": {
      "a": "Testing black-box",
      "b": "Testing esplorativo",
      "c": "Testing checklist-based",
      "d": "Error guessing"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 39,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. La lista di best practice della user interface è la lista delle condizioni di test da verificare sistematicamente"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Il libro fornisce una guida generale e non è un documento di requisiti formale, una specifica o un insieme di usecase, user story o processi di business",
      "b": "Non è corretta. Sebbene si potrebbe considerare la lista come un insieme di test charter, è più similare alla lista delle condizioni di test da verificare",
      "d": "Non è corretta. I test non sono focalizzati sui failure che potrebbero verificarsi, ma piuttosto sulla conoscenza di quello che è importante per l'utente, in termini di usabilità"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.4.3",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 29,
    "question_number": "A18",
    "question_text": "Quale delle seguenti affermazioni descrive MEGLIO l'approccio collaborativo alla scrittura delle user story?",
    "question_option": {
      "a": "Le user story vengono create dai tester e dagli sviluppatori e poi accettate dai rappresentanti dibusiness",
      "b": "Le user story vengono create in modo congiunto dai rappresentanti di business, dagli sviluppatori e dai tester",
      "c": "Le user story vengono create dai rappresentanti di business e verificate dagli sviluppatori e dai tester",
      "d": "Le user story vengono create in modo che siano indipendenti, negoziabili, di valore, stimabili, piccole e verificabili"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 40,
    "answer_option": "b",
    "answer_option_text": {
      "b": "È corretta. La scrittura collaborativa delle user story significa che tutti gli stakeholder creano le user story in modo collaborativo, per ottenere una vision condivisa"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. La scrittura collaborativa delle user story significa che tutti gli stakeholder creano le user story in modo collaborativo, per ottenere una vision condivisa",
      "c": "Non è corretta. La scrittura collaborativa delle user story significa che tutti gli stakeholder creano le user story in modo collaborativo, per ottenere una vision condivisa",
      "d": "Non è corretta. Questa è la lista delle proprietà che ogni user story dovrebbe avere, non la descrizione dell'approccio basato sulla collaborazione"
    },
    "ambiguous": false,
    "learning_objective": "FL-4.5.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 30,
    "question_number": "A19",
    "question_text": "Si consideri la seguente parte di un test plan: Il testing verrà eseguito utilizzando il testing di componente e il testing di integrazione dei componenti. Le normative richiedono di dimostrare che per ogni componente classificato come critico sia stato raggiunto il 100% di copertura dei rami. A quale elemento del test plan appartiene questa parte?",
    "question_option": {
      "a": "Comunicazione",
      "b": "Risk register",
      "c": "Contesto del testing",
      "d": "Approccio del test"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 40,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. II paragrafo contiene informazioni sui livelli di test e sui criteri di uscita, che sono parte dell'approccio di test"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. II paragrafo contiene informazioni sui livelli di test e sui criteri di uscita, che sono parte dell'approccio del test",
      "b": "Non è corretta. II paragrafo contiene informazioni sui livelli di test e sui criteri di uscita, che sono parte dell'approccio del test",
      "c": "Non è corretta. II paragrafo contiene informazioni sui livelli di test e sui criteri di uscita, che sono parte dell'approccio del test"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.1.1",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 30,
    "question_number": "A20",
    "question_text": "Il vostro team utilizza il planning poker per stimare l'effort del test per una nuova funzionalità. Nel vostro team esiste la regola che se manca il tempo necessario per raggiungere un accordo di consenso totale e la variazione nei risultati è minima, si possono applicare regole come \"accetta il numero con più voti\". Dopo due turni, il consenso non è stato raggiunto e quindi è stato iniziato il terzo turno. I risultati della stima del test sono riportati nella tabella seguente: Quale dei seguenti è il MIGLIOR esempio di passo successivo?",
    "question_option": {
      "a": "Il product owner deve intervenire e prendere una decisione finale",
      "b": "Accettare 13 come stima finale del test, poiché ha ottenuto il maggior numero di voti",
      "c": "Non sono necessarie ulteriori azioni. Il consenso è stato raggiunto",
      "d": "Eliminare la nuova funzionalità dall'attuale release perché non è stato raggiunto il consenso"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 41,
    "answer_option": "b",
    "answer_option_text": {
      "b": "È corretta. Se le stime di test non sono uguali, ma la variazione nei risultati è piccola, si possono applicare regole come \"accetta il numero con più voti\""
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Questa dovrebbe essere un'attività del team e non dovrebbe essere eseguita da un unico membro del team",
      "c": "Non è corretta. Non esiste ancora un consenso: alcuni dicono 13, altri 8",
      "d": "Non è corretta. Una funzionalità non dovrebbe essere eliminata solo perché il team non è concorde sulle stime del test"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.1.4",
    "k_level": "K3",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 31,
    "question_number": "A21",
    "question_text": "Quale delle seguenti affermazioni è VERA relativamente alla piramide di test?",
    "question_option": {
      "a": "Enfatizza di avere più test ai livelli di test più bassi",
      "b": "Suggerisce che ogni test di basso livello verifichi buona parte della funzionalità",
      "c": "Descrive la distribuzione del testing nel ciclo di vita del software",
      "d": "Non ha impatti sulla costruzione dei test automatizzati"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 41,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. La piramide di test enfatizza la presenza di un numero maggiore di test ai livelli di test inferiori"
    },
    "no_answer_option_text": {
      "b": "Non è corretta. Non è vero che un test dei livelli più bassi verifica buona parte della funzionalità. I test sono più atomici e orientati su una specifica logica, quindi è il contrario",
      "c": "Non è corretta. La piramide di test mostra come il numero di test viene distributo nei livelli di test",
      "d": "Non è corretta. La piramide di test supporta il team nella test automation"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.1.6",
    "k_level": "K1",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 31,
    "question_number": "A22",
    "question_text": "Durante l'analisi dei rischi, il team ha considerato il seguente rischio: \"Il sistema consente uno sconto troppo elevato per un cliente\". Il team ha stimato l'impatto del rischio come molto alto. Cosa si può dire della probabilità del rischio?",
    "question_option": {
      "a": "Anche la probabilità è molto alta. Un alto impatto del rischio implica sempre un'alta probabilità del rischio",
      "b": "La probabilità è molto bassa. Un alto impatto del rischio implica sempre una bassa probabilità del rischio",
      "c": "Non si può dire nulla sulla probabilità del rischio. L'impatto e la probabilità del rischio sono indipendenti",
      "d": "La probabilità del rischio non è importante con un impatto così alto. Non è necessario definirla"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 41,
    "answer_option": "c",
    "answer_option_text": {
      "c": "È corretta. L'impatto e la probabilità del rischio sono indipendenti"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. L'impatto e la probabilità del rischio sono indipendenti",
      "b": "Non è corretta. L'impatto e la probabilità del rischio sono indipendenti",
      "d": "Non è corretta. Occorrono entrambi i fattori per calcolare illivello di rischio"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.2.1",
    "k_level": "K1",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 31,
    "question_number": "A23",
    "question_text": "La seguente lista contiene i rischi che sono stati identificati per un nuovo prodotto software da sviluppare: i. Il management sposta due tester esperti in un altro progetto ii. Il sistema non è conforme agli standard della safety funzionale iii. Il tempo di risposta del sistema supera i requisiti dell'utente iv. Gli stakeholder hanno aspettative inaccurate v. Le persone diversamente abili hanno problemi durante l'utilizzo del sistema Quali sono i rischi di progetto?",
    "question_option": {
      "a": "i, iv sono rischi di progetto",
      "b": "iv, v sono rischi di progetto",
      "c": "i, iii sono rischi di progetto",
      "d": "ii, v sono rischi di progetto"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 42,
    "answer_option": "a",
    "answer_option_text": {
      "a": "È corretta. Si consideri che: i. È un rischio di progetto. iv. È un rischio di progetto."
    },
    "no_answer_option_text": {
      "b": "Non è corretta",
      "c": "Non è corretta",
      "d": "Non è corretta"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.2.2",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 32,
    "question_number": "A24",
    "question_text": "Quale dei seguenti è un esempio di come l'analisi dei rischi di prodotto influenzi la completezza e l'ambito del testing?",
    "question_option": {
      "a": "Il test manager monitora e fornisce il reporting del livello di rischio di tutti i rischi conosciuti su base giornaliera, in modo che gli stakeholder possano prendere una decisione informata sulla data di rilascio",
      "b": "Uno dei rischi identificati era la \"Mancanza del supporto di database open-source\", quindi il team ha deciso di integrare il sistema con un database open-source",
      "c": "Durante l'analisi quantitativa del rischio, il team ha stimato il livello di rischio totale di tutti i rischi identificati e lo ha indicato come rischio residuo totale prima del testing",
      "d": "La valutazione del rischio ha rivelato un livello molto alto di rischio di efficienza delle prestazioni, quindi è stato deciso di eseguire un performance testing dettagliato nelle prime fasi del ciclo di vita del software"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 42,
    "answer_option": "d",
    "answer_option_text": {
      "d": "È corretta. Questo mostra come l'analisi dei rischi influisca sulla completezza del testing (cioè sul livello di dettaglio)"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Questo è un esempio di attività di monitoraggio del rischio, non di analisi del rischio",
      "b": "Non è corretta. Questo è un esempio di decisione architetturale, non correlata al testing",
      "c": "Non è corretta. Questo è un esempio di esecuzione di un'analisi quantitativa del rischio e non è correlato all'accuratezza o all'ambito del testing"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.2.3",
    "k_level": "K2",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 32,
    "question_number": "A25",
    "question_text": "Quali DUE delle seguenti opzioni sono metriche comuni utilizzate per il reporting del livello di qualità dell'oggetto di test?",
    "question_option": {
      "a": "Numero di difetti rilevati durante il testing di sistema",
      "b": "Effort totale della progettazione dei test diviso per il numero di test case progettati",
      "c": "Numero di procedure di test eseguite",
      "d": "Numero di difetti rilevati diviso per la dimensione di un prodotto di lavoro",
      "e": "Tempo necessario per correggere un difetto"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 43,
    "answer_option": "a,d",
    "answer_option_text": {
      "a": "È corretta. Il numero di difetti rilevati è correlato alla qualità dell'oggetto di test",
      "d": "È corretta. La densità dei difetti è correlata alla qualità dell'oggetto di test"
    },
    "no_answer_option_text": {
      "b": "Non è corretta. Questa è la misura dell'efficienza del test, non della qualità dell'oggetto di test",
      "c": "Non è corretta. Il numero di test case eseguiti non dà informazioni sulla qualità: i risultati dei test potrebbero darle",
      "e": "Non è corretta. Il tempo di correzione è una metrica di processo. Non dà informazioni sulla qualità del prodotto"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.3.1",
    "k_level": "K1",
    "points": 1
  },
  {
    "question_pdf": "ITASTQB-QTEST-FL-2023-A.pdf",
    "question_page": 32,
    "question_number": "A26",
    "question_text": "Quale delle seguenti informazioni contenute in un test progress report è la MENO utile per i rappresentanti di business?",
    "question_option": {
      "a": "Impedimenti al testing",
      "b": "Copertura dei rami raggiunta",
      "c": "Stato di avanzamento dei test",
      "d": "Nuovi rischi all'interno del ciclo di test"
    },
    "answer_pdf": "ITASTQB-QTEST-FL-2023-A-SOL.pdf",
    "answer_page": 43,
    "answer_option": "b",
    "answer_option_text": {
      "b": "È corretta. Il testing dei rami è una metrica tecnica utilizzata da sviluppatori e tester tecnici. Queste informazioni non sono di alcun interesse per i rappresentanti di business"
    },
    "no_answer_option_text": {
      "a": "Non è corretta. Gli impedimenti al testing possono essere di alto livello e relativi al business, quindi questa è un'informazione importante per gli stakeholder di business",
      "c": "Non è corretta. L'avanzamento dei test è relativo al progetto, quindi può essere utile per i rappresentanti di business",
      "d": "Non è corretta. I rischi hanno un impatto sulla qualità del prodotto, quindi può essere utile per i rappresentanti di business"
    },
    "ambiguous": false,
    "learning_objective": "FL-5.3.2",
    "k_level": "K2",
    "points": 1
  }
]